# DATA FRAMES IN Python

**Data frames**  are more complex containers of values. The most common analogy is a spreadsheet.

## 1. Creating

In [6]:
namesP=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
agesP=[32,33,28,30,29]
countryP=["China", "Senegal", "España", "Norway","Korea"]
educationP=["Bach", "Bach", "Master", "PhD","PhD"]

classroomP=dict(student=namesP,age=agesP,edu=educationP,country=countryP)

import pandas as pd

# our data frame:
studentsP=pd.DataFrame(classroomP)
## see it:
studentsP

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master   España
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [9]:
studentsP.loc[2,'student']='Lito'
studentsP.loc[[2,4],'age']=[32,31]

femaleP=[True,True,False,False,True]
studentsP1=studentsP.assign(female=femaleP)
studentsP1.iloc[0,1]=33

In [8]:
#currently
studentsP1

     student  age     edu  country  female
0       Qing   32    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

## Queries

In [10]:
#who is the oldest?

studentsP1[studentsP1.age==max(studentsP1.age)]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True

In [11]:
studentsP1[studentsP1.age==studentsP1.age.max()]['student']

0         Qing
1    Françoise
Name: student, dtype: object

In [12]:
#who has PhD?

studentsP1[studentsP1.edu=='PhD']

  student  age  edu country  female
3   Bjork   30  PhD  Norway   False
4   Marie   31  PhD   Korea    True

In [13]:
#who has PhD or Master?
studentsP1[studentsP1.edu.isin(['PhD','Master'])]

  student  age     edu country  female
2    Lito   32  Master  España   False
3   Bjork   30     PhD  Norway   False
4   Marie   31     PhD   Korea    True

In [14]:
#who does not has PhD or Master?
studentsP1[~studentsP1.edu.isin(['PhD','Master'])]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True

In [15]:
#the youngest female
studentsP1[studentsP1.female]

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True
4      Marie   31   PhD    Korea    True

In [16]:
studentsP1[studentsP1.female].sort_values(by=['age'],ascending=True).iloc[0,0]

'Marie'

In [17]:
studentsP1

     student  age     edu  country  female
0       Qing   33    Bach    China    True
1  Françoise   33    Bach  Senegal    True
2       Lito   32  Master   España   False
3      Bjork   30     PhD   Norway   False
4      Marie   31     PhD    Korea    True

In [18]:
studentsP1[studentsP1.female & studentsP1.age==studentsP1.age.min()]

Empty DataFrame
Columns: [student, age, edu, country, female]
Index: []

In [19]:
femdf=studentsP1[studentsP1.female]
femdf

     student  age   edu  country  female
0       Qing   33  Bach    China    True
1  Françoise   33  Bach  Senegal    True
4      Marie   31   PhD    Korea    True

In [20]:
femdf[femdf.age==femdf.age.min()]

  student  age  edu country  female
4   Marie   31  PhD   Korea    True

In [21]:
femdf[femdf.age==femdf.age.min()]['student']

4    Marie
Name: student, dtype: object